app/controllers/microposts_controller.rb

INSERT INTO `microposts` (`content`, `user_id`, `created_at`, `updated_at`, `picture`) VALUES ('a\r\n', 101, '2021-01-05 07:53:06', '2021-01-05 07:53:06', '2.png')
---
    def create
        @micropost = current_user.microposts.build(micropost_params)
        if @micropost.save