app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT COUNT(*) FROM `microposts` WHERE `microposts`.`user_id` = 1
SELECT `microposts`.* FROM `microposts` WHERE `microposts`.`user_id` = 1 ORDER BY `microposts`.`created_at` DESC LIMIT 30 OFFSET 0
---
  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(page: params[:page])

INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `password_digest`, `activation_digest`) VALUES ('a', 'a@g.com', '2021-01-06 08:30:40.424570', '2021-01-06 08:30:40.424570', '$2a$12$nv28bmMOBQzJZVEtVhADuesaFYr7vCI5hbDu4BTnKIG0da/8Ugg12', '$2a$12$6Wd9STYnxuHoY3dsVzz6V.5XEsJlr/kUzF1/Mb2TBHchwQuZNEwU2')
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `users`.`password_digest` = '$2a$12$8WWAo8vsxrMsm2R1XyaR9.QgvjICokpNDuM/bZZ7/.M9PSG1Q4LzS', `users`.`updated_at` = '2020-11-16 19:24:03.222194' WHERE `users`.`id` = 1
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)